In [1]:
#Import library
import pandas as pd

In [2]:
#Import the dataset
df = pd.read_csv("salaries.csv")
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [4]:
#Delete some rowns, separate target
inputs = df.drop("salary_more_then_100k", axis='columns')
target = df["salary_more_then_100k"]

In [5]:
inputs.head()

  company                  job     degree
0  google      sales executive  bachelors
1  google      sales executive    masters
2  google     business manager  bachelors
3  google     business manager    masters
4  google  computer programmer  bachelors

In [6]:
#Show first 5 lines of the target
target.head()

0    0
1    0
2    1
3    1
4    0
Name: salary_more_then_100k, dtype: int64

In [ ]:
"""Convert inputs into numbers"""

In [7]:
#Import LabelEncoder to transform text data to the numbers
from sklearn.preprocessing import LabelEncoder

In [8]:
# 
le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

In [10]:
inputs["company_n"] = le_company.fit_transform(inputs["company"])
inputs["job_n"] = le_company.fit_transform(inputs["job"])
inputs["degree_n"] = le_company.fit_transform(inputs["degree"])
inputs.head()

  company                  job     degree  company_n  job_n  degree_n
0  google      sales executive  bachelors          2      2         0
1  google      sales executive    masters          2      2         1
2  google     business manager  bachelors          2      0         0
3  google     business manager    masters          2      0         1
4  google  computer programmer  bachelors          2      1         0

In [11]:
inputs_n = inputs.drop(["company", "job", "degree"], axis="columns")
inputs_n

    company_n  job_n  degree_n
0           2      2         0
1           2      2         1
2           2      0         0
3           2      0         1
4           2      1         0
5           2      1         1
6           0      2         1
7           0      1         0
8           0      0         0
9           0      0         1
10          1      2         0
11          1      2         1
12          1      0         0
13          1      0         1
14          1      1         0
15          1      1         1

In [12]:
"""NOW WE ARE READY TO TRAIN OUR CLASSIFIER"""

'NOW WE ARE READY TO TRAIN OUR CLASSIFIER'

In [13]:
#Import library
from sklearn import tree

In [14]:
#Import object
model = tree.DecisionTreeClassifier()

In [15]:
#Fit the model
model.fit(inputs_n, target)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=None, splitter='best')

In [17]:

model.score(inputs_n, target)

1.0

In [19]:
# predict by company, job, degree
model.predict([[2, 2, 1]])

array([0], dtype=int64)

In [20]:
# predict by company, job, degree
model.predict([[2, 0, 0]])

array([1], dtype=int64)